Repository: malenkiki/Pyntervals
Catalog: po/*.po
Languages: fr

source: Token you must get from http://xx.timetask.com/account/api in order to use this tool.
fr: Vous devez obtenir votre jeton sur http://xx.timetask.com/account/api pour utiliser cet outil.

source: STRING
fr: CHAÎNE

source: Use given ID for some actions to have specific one intead of several of them
fr: Utilise le ID donné afin d’avoir pour certaines actions qu’un élément au lieu de plusieurs

source: INTEGER
fr: ENTIER

source: Action to do with API. Valid actions are:
fr: Action à réaliser avec l’API. Les actions valides sont :

source: Set one filter. Call it for each filter you want use.
fr: Utilise un filtre. À appeler pour chaque filtre à utiliser.

source: Give an offset for returned list
fr: Donne un point de départ pour la liste retournée

source: Give a limit for returned list
fr: Fournit une taille limite à la liste retournée

source: Returns list that follow the given pattern
fr: Retourne une liste qui correspond au motif de recherche donné

source: Export time as CSV file. If you are admin, returns times for all members, if not, returns only yours. By default, outputs previous month, but you can choose date range by using filters.
fr: Exporte les temps sous forme d’un fichier CSV. Si vous êtes administrateur, ça retournera les temps de tous les membres, dans le cas contraire ça ne retournera que les votres. Par défaut, le mois précédent est sorti, mais vous pouvez choisir un intervalle de date en utilisant les filtres.

source: FILE
fr: FICHIER

source: If export as CSV is selected, this option allow you give what field to display in sort you want.
fr: Si l’export CSV est sélectionné, cette option vous permet de spécifier quels champs seront affichés et dans quel ordre vous les souhaitez.

source: Export given action as CSV if it is a collection.
fr: Exporte l’action donnée comme un CSV si c’est une collection.

source: Print list of available actions.
fr: Affiche la liste des actions disponibles.

source: Returns response as XML. If not given, JSON is used.
fr: Retourne la réponse comme un XML. Si non précisé, JSON est utilisé.
